# ===== Question =====
# 題目給一個只有左右括號 () 的合法字元組 list，然後要把這些括號組編號成 0 或 1
# 接著對於每個括號組的深度做計算，然後回傳總體最小化深度的編號方法
# 空字元的深度為 0 ，括號裡面為空深度為 1，巢狀括號的深度計算如下
# AB為合法的括號組，(A + B)取其中深度最大者，(A)則取 1 + (A 的深度)為 (A) 的深度

# ===== Thoughts =====
# 想法很簡單，要做到最小化就是讓每一層往下計算的時候同一層都排給同一個編號，這邊反向思考一下
# 把最外圍當成深度 0(或1)，然後每往內包一層就 +1 深度，這樣子就可以區分我現在到底在哪一層
# 像是 ( ( () ) () ) 的話就排成 0 1 0 0 1 1 1 0，這樣最大深度是 3
# 假設使用編號是 0 1 1 1 1 1 1 0，這樣會導致1的最大深度變成 4，就沒有最小化深度了
# 所以這邊可以簡單地用奇偶來做深度計算跟編號

# Method - ?
class Solution:
    def maxDepthAfterSplit(self, seq: str) -> list[int]:
        ans = []
        depth = -1

        for s in seq:
            if s == '(':
                depth += 1
                ans.append( depth % 2 )
            else:
                ans.append( depth % 2 )
                depth -= 1
        
        return ans
