# ===== Question =====
# 題目給一個只有 () 的字串，每個佐括號要組成合法括號組的話要搭配兩個連續的右括號
# 問最少要補幾次括號才能讓整個字串是合法的(左右括號合算)
# 也就是 ()) 唯一組， ()A) 這樣不合法，因為沒有連續右括號，這邊的A是非空的合法括號組

# ===== Thoughts =====
# 處理括號組問題的話 stack 或是計數法，這題因為要求要連續兩個右括號才能夠組合法組合
# 所以這邊去計算右括號數量去對應左括號，右括號就 count + 1，沒有問題
# 但遇到左括號就要處理問題了，如果右括號剩餘數量 <= 1 的話就直接補成一組
# 該補右括號就補，最後再重製計數就好了
# 如果右括號數量比較多的情況下就是直接拆兩個來用，但是這邊還要多檢查奇偶
# 因為遇到左括號就代表說有可能導致後續照原樣繼續作計算的時候會有一組合法括號卡在兩個右括號裡面
# 例如 ()"())")，"" 內是一組合法字串，所以左右的右括號不是連續的，如果沒有額外處理會導致漏計算
# 所以這邊在遇到奇數右括號的狀況時直接補上一個右括號，讓右括號的數量維持偶數
# 這樣就可以確保之後遇到左括號的時候都一定可以取道完整的一組連續雙右括號來做組合
# 同時這樣的操作也是必需的，因為到時候再做組合的時候一定就要去補
# 最後再根據剩餘的右括號數量計算需要幾個左括號來湊組合
# //2 代表完整組數，%2 檢查最後一個左掛號之後有的右括號有沒有是奇數個，奇數個就需要多加一組()來完成

# Method 1 - Bracket count
class Solution:
    def minInsertions(self, s: str) -> int:
        right_count = 0
        ans = 0

        for c in s[::-1]:
            if c == ')':
                right_count += 1
            else:
                if right_count <= 1:
                    ans += 2 - right_count
                    right_count = 0
                else: # count 2,3,...
                    if right_count % 2:
                        right_count += 1
                        ans += 1
                    right_count -= 2
        
        return ans + right_count // 2 + (right_count % 2) * 2
